// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

Console.Write("Введите целое число a: ");
int a = Convert.ToInt32(Console.ReadLine()); 
int i = 0;
     while a>0;

      if ( a%2==0)
      {i=i+1;
      }
{
Console.Write($"Число {i} являются четными числами: " );
}
   // не получилось