//Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.

Console.Write("Введите целое число: ");
int number1 = Convert.ToInt32(Console.ReadLine()); 
int i=0;
for i do number1;

Console.Write($"Результат: {i} ");


// НЕ понял